cf/BusinessProcesses/РемонтИнструмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<BusinessProcess>
		<Properties>
			<Name>РемонтИнструмента</Name>
			<Task>Task.ЗадачаПользователю</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расчет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветМенеджера</Name>
					<Comment>0 - нет ответа, 1 - ждать оплату, 2 - отсрочка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаменныйИнструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнструментПринят</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГарантияСогласована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверитьОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контакты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКартинок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьГарантия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПроведенияДополнительныхРабот</Name>
					<Comment>0-проводить работы; 1-по согласованию; 2-ничего не делать</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧисткаГрязногоИнструмента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Неисправность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Неисправности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гарантия</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СогласованияСКлиентом</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Comment>3 - отказ, 2 - согласовано, 1 - принят, 0 - доработать</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Картинки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Картинка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КартинкиРемонта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

cf/Enums/ТипыТекстовЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыТекстовЭлектронныхПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмеченныйТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTMLСКартинками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/СостоянияЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СостоянияЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВОчередиНаСборку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОчередиНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОчередиНаСкладПовторно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПеремещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОтвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгруженЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собирается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собран</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобранЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитьЗаявку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятьИнструмент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласоватьГарантию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвестиДефектовку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередатьНаСкладВыдачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередатьКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредупредитьКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласоватьСКлиентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПутиЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненПоТехническимПричинам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Редактируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
					<Comment>Когда товар отправлен в доставку</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
					<Comment>Когда товар принял получатель или транспортная компания</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставленЧастично</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/Письмо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Письмо</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>стрДокументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофильИнтернетПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СвязанныеДокументы</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
								<v8:Type>cfg:DocumentRef.АктСверкиВзаиморасчетов</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомуСписок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кому</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КопияСписок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кому</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/BusinessProcesses/РемонтИнструмента/Ext/ObjectModule.bsl
Функция ПредставлениеЗадачи(Задача)
	
	Заказ = Задача.БизнесПроцесс.ЗаказНаряд;
    
	НомерЗаказа   = СокрЛП(Заказ.Номер);
	Пока Лев(НомерЗаказа, 1)="0" Цикл   			  // удаление ведущих нулей
		НомерЗаказа = Сред(НомерЗаказа, 2);
	КонецЦикла;

	Возврат Задача.Наименование + " № "  + НомерЗаказа + " (" + Формат(Заказ.Сумма, "Ч15.2,") + ") " + ?(ТипЗнч(Заказ) = Тип("ДокументСсылка.ИнтернетЗаказПокупателя"), Заказ.ПользовательИнтернет, Заказ.Контрагент);
	
КонецФункции  
Процедура ПередЗаписью(Отказ)
	
	КоличествоКартинок = ЭтотОбъект.Картинки.Количество();
	
	// Если есть хоть одна гарантия значит гарантия
	
	ЕстьГарантия = Товары.Найти(Истина, "Гарантия") <> Неопределено;
	
КонецПроцедуры

// ДОПОЛНИТЕЛЬНО

Функция СообщитьМенеджеруОЗадаче(Задача)
	
	// Если все нормально тогда вернет текст для оповещения пользователю
	// если нет тогда пустую строку
	
	ТемаПисьма 	= "Контроль оплаты за ремонт инструмента";
	
	ТипТекста 	= Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
			
	ТекстПисьма = "Вам назначена задача """ + Строка(Задача) + """
				|Необходимо проконтролировать оплату клиента """ + Строка(Контрагент) + """ по """ + Строка(ЗаказНаряд) + """" ;
				
	НачатьТранзакцию();
			
	// Создадим ссылку на письмо
			
	Письмо = Документы.Письмо.СоздатьДокумент();
	Письмо.Дата = ТекущаяДата();
			
	Попытка
		Письмо.Записать(); 
	Исключение
		ОбщиеФункции.СообщитьТекст(ОбщегоНазначенияКлиентСервер.ПолучитьПредставлениеОписанияОшибки(ИнформацияОбОшибке()));
		ОтменитьТранзакцию();
		Возврат "";
	КонецПопытки;
						
	// Отправим письмо
	Отказ = Ложь;		
	Письмо = ОбщиеФункции.ОповеститьПоПочте(Контрагент.ОсновнойМенеджер.Почта, ТемаПисьма, ТекстПисьма, , ТипТекста, Письмо);
			
	Если Отказ Тогда
		ОтменитьТранзакцию();
		Возврат "";
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	Возврат "Было отправлено письмо менеджеру с формой счета для котроля оплаты ремонта";
	
КонецФункции
Функция СоздатьИПровестиРеализацию()

	Если НЕ ЗаказНаряд.Проведен ИЛИ ЗаказНаряд.Сумма = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// пока будем проверять, может уже есть реализация для этого З-Н
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Документ.РеализацияТоваров ГДЕ Заказ = &ЗаказНаряд");
	Запрос.УстановитьПараметр("ЗаказНаряд", ЗаказНаряд);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		РеализацияТоваров = Выборка.Ссылка;
		Возврат Истина;
	КонецЕсли;
	
	Реализация = Документы.РеализацияТоваров.СоздатьДокумент();
	Реализация.Дата	= ТекущаяДата();
	
	Реализация.Заполнить(ЗаказНаряд);
	
	Попытка
		Реализация.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		стрОшибки = ОписаниеОшибки();
		ОбщиеФункции.СообщитьТекст("Ошибка при записи реализации товаров
								|" + стрОшибки);
		Возврат Ложь;
	КонецПопытки;
	
	// Заполним оплаты
	
	Реализация.ЗаполнитьДокументыОплаты(Реализация.Ссылка);
	
	Попытка
		Реализация.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		стрОшибки = ОписаниеОшибки();
		ОбщиеФункции.СообщитьТекст("Ошибка при проведении реализации товаров
								|" + стрОшибки);
		Возврат Ложь;
	КонецПопытки;
	
	РеализацияТоваров = Реализация.Ссылка;
	
	Возврат Истина;
		
КонецФункции
Функция ПоменятьОрганизациюВЗаказНаряде() Экспорт
	
	Если ЗаказНаряд.Пустая() ИЛИ Организация = ЗаказНаряд.Организация Тогда
		Возврат Истина;
	КонецЕсли;
		
	ЗаказОбъект = ЗаказНаряд.ПолучитьОбъект();
	ЗаказОбъект.Организация = Организация;

	Таблица = ЗаказОбъект.Товары;
	
	Если Организация.УчитыватьНДС <> ЗаказНаряд.УчитыватьНДС Тогда
	
		СтруктураКолонокТовары = Новый Структура("ЕстьКоличество, ЕстьЦена, ЕстьСуммаБезСкидки, ЕстьСумма, ЕстьСуммаАвтоматическойСкидки, ЕстьСуммаРучнойСкидки, ЕстьСтавкаНДС, ЕстьСуммаНДС, ЕстьВсего, УчитыватьНДС, стУчитыватьНДС",
													Истина, Ложь, Ложь, Истина, Истина, Ложь, Истина, Истина, Ложь, Организация.УчитыватьНДС, ЗаказНаряд.УчитыватьНДС);
		ФункцииФормДокументов.ПересчитатьСуммыТабличныхЧастей(Таблица, СтруктураКолонокТовары);
		
	КонецЕсли;
				
	Попытка
		ЗаказОбъект.Записать(?(ЗаказОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
	Исключение
		стрОшибки = ОписаниеОшибки();
		ОбщиеФункции.СообщитьТекст("Ошибка при записи заказ-наряда
								|" + стрОшибки);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции
Функция ПолучитьПоследнююЗадачу(ТочкаМаршрута = Неопределено)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Задача.ЗадачаПользователю
	|ГДЕ
	|	БизнесПроцесс = &БизнесПроцесс И " + ?(ТочкаМаршрута = Неопределено, "" , "
	|	ТочкаМаршрута = &ТочкаМаршрута И ") + "
	|	Выполнена И
	|	Не ПометкаУдаления 
	|УПОРЯДОЧИТЬ ПО Дата Убыв");
	
	Запрос.УстановитьПараметр("БизнесПроцесс", Ссылка);
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда	Возврат Выборка.Ссылка; КонецЕсли;
		
	Возврат Неопределено;
	
КонецФункции


// Процедура РемонтПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
//	
//	//НеПроверятьПроведениеЗаказа = Ложь;
//	//ДополнительныеСвойства.Свойство("НеПроверятьПроведениеЗаказа", НеПроверятьПроведениеЗаказа);
//	
//	Если ЗаказНаряд.ПометкаУдаления Тогда
//		
//		Отказ = Истина;
//		ОбщиеФункции.СообщитьТекст("Заказ наряд помечен на удаление");
//		
//	ИначеЕсли //Не НеПроверятьПроведениеЗаказа И 
//		не ЗаказНаряд.Проведен Тогда
//		
//		Отказ = Истина;
//		ОбщиеФункции.СообщитьТекст("Заказ наряд не проведен");
//		
//	КонецЕсли;
//		
//КонецПроцедуры


Процедура ПроизвестиДеффектовкуПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	

	//Если ЗаказНаряд.Пустая() И ИнструментПринят Тогда
	//	
	//	Отказ = Истина;
	//	ОбщиеФункции.СообщитьТекст("Не создан заказ наряд");
		
	Если ЗаказНаряд.ПометкаУдаления Тогда
		
		Отказ = Истина;
		ОбщиеФункции.СообщитьТекст("Заказ наряд помечен на удаление");
		
	ИначеЕсли НЕ ЗаказНаряд.Пустая() Тогда
		
		// Проверим что все в заказ наряде заполненно и не будет ругатся при проведении
		
		стрОшибки = "";
		Если Не ФункцииФормДокументов.ПроверитьДокументНаКорректностьЗаполнения(ЗаказНаряд, стрОшибки) Тогда
			
			Отказ = Истина;
			ОбщиеФункции.СообщитьТекст("Ошибка в заполнении заказ наряда №" + ЗаказНаряд.Номер  + " от " + Формат(ЗаказНаряд.Дата, "ДЛФ=DD") + "
				|" + стрОшибки);
			
		КонецЕсли;
		
	КонецЕсли;
			
КонецПроцедуры

Процедура ПередатьКлиентуПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	//Если НЕ ПоменятьОрганизациюВЗаказНаряде() Тогда
	//	Отказ = Истина;
	//КонецЕсли;  	
	
	// отгружаем клиенту
	
	Если Задача.Склад = СкладПолучатель Тогда
		СоздатьИПровестиРеализацию();
	КонецЕсли;
	
КонецПроцедуры
 

// ОБРАБОТКИ

Процедура ЗавершитьРемонтОбработка(ТочкаМаршрутаБизнесПроцесса)

	СоздатьИПровестиРеализацию();
	
КонецПроцедуры

// НАЗНАЧЕНИЕ СКЛАДОВ
Процедура ОформитьЗаявкуПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл Задача.Склад = СкладПолучатель КонецЦикла;
	Если Не Заказы.УстановитьСостояниеЗаказа(Ссылка, Перечисления.СостоянияЗаказа.ПринятьИнструмент) Тогда Отказ = Истина КонецЕсли;
	
КонецПроцедуры

Процедура ПринятьИнструментПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл Задача.Склад = Склад КонецЦикла;
	Если Не Заказы.УстановитьСостояниеЗаказа(Ссылка, Перечисления.СостоянияЗаказа.ОформитьЗаявку) Тогда Отказ = Истина КонецЕсли;

КонецПроцедуры
Процедура СогласоватьГарантиюПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Если Не Заказы.УстановитьСостояниеЗаказа(Ссылка, Перечисления.СостоянияЗаказа.СогласоватьГарантию) Тогда Отказ = Истина КонецЕсли;
	
	//Для Каждого Задача Из ФормируемыеЗадачи Цикл
	//	
	//	Задача.Склад = Склад;
	//	
	//КонецЦикла;

КонецПроцедуры

Процедура ПроизвестиДефектовкуПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл Задача.Склад = Склад КонецЦикла;
	Если Не Заказы.УстановитьСостояниеЗаказа(Ссылка, Перечисления.СостоянияЗаказа.ПроизвестиДефектовку) Тогда Отказ = Истина КонецЕсли;

КонецПроцедуры

Процедура СогласоватьСКлиентомПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл Задача.Склад = Склад КонецЦикла;
	Если Не Заказы.УстановитьСостояниеЗаказа(Ссылка, Перечисления.СостоянияЗаказа.СогласоватьСКлиентом) Тогда Отказ = Истина КонецЕсли;
	
КонецПроцедуры
Процедура ПредупредитьКлиентаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл Задача.Склад = Склад КонецЦикла;
	Если Не Заказы.УстановитьСостояниеЗаказа(Ссылка, Перечисления.СостоянияЗаказа.ПредупредитьКлиента) Тогда Отказ = Истина КонецЕсли;
	
КонецПроцедуры

Процедура ОжиданиеОплатыПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		
		Задача.Пользователь = Менеджер;
		
		Сообщение = СообщитьМенеджеруОЗадаче(Задача);
		Если Не ПустаяСтрока(Сообщение) Тогда
				
				//ПоказатьОповещениеПользователя("Автоматическая рассылка",, Сообщение, БиблиотекаКартинок.Почта);
				
		КонецЕсли;
  					
	КонецЦикла;
	
	Если Не Заказы.УстановитьСостояниеЗаказа(Ссылка, Перечисления.СостоянияЗаказа.ОжиданиеОплаты) Тогда Отказ = Истина КонецЕсли;

КонецПроцедуры
Процедура ПередатьКлиентуПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Если ПолучитьПоследнююЗадачу(ТочкаМаршрутаБизнесПроцесса) = Неопределено Тогда
			Задача.Склад = Склад;
		Иначе
			Задача.Склад = СкладПолучатель;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не Заказы.УстановитьСостояниеЗаказа(Ссылка, Перечисления.СостоянияЗаказа.ПередатьКлиенту) Тогда Отказ = Истина КонецЕсли;
	
КонецПроцедуры
Процедура ОжиданиеОплаты1ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл Задача.Склад = СкладПолучатель КонецЦикла;
	Если Не Заказы.УстановитьСостояниеЗаказа(Ссылка, Перечисления.СостоянияЗаказа.ОжиданиеОплаты) Тогда Отказ = Истина КонецЕсли;

КонецПроцедуры


// УСЛОВИЯ

Процедура РемонтОтмененПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = НЕ ИнструментПринят;
КонецПроцедуры
Процедура УдаленныйСкладПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Склад <> СкладПолучатель;
КонецПроцедуры

Процедура ИнструментПринятПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ИнструментПринят;
	
КонецПроцедуры
Процедура ЕстьГарантийныеИнструментыПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)	
	
	Результат = Булево(Товары.НайтиСтроки(Новый Структура("Гарантия", Истина)).Количество());
	
КонецПроцедуры
Процедура ГарантияСогласованаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ГарантияСогласована;

КонецПроцедуры

Процедура СогласованиеСКлиентомОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	Ответ 		= 0;
	Кол 		= СогласованияСКлиентом.Количество();
	
	Если Кол Тогда
		
		Ответ = СогласованияСКлиентом[Кол - 1].ВариантОтвета;
		
	КонецЕсли;
	
	Результат = ТочкаВыбораВарианта.Варианты[Ответ];
	
КонецПроцедуры

Процедура ТребуетсяОплатаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	// 	Если требуется оплата (это не полная гарантия и заказ-наряд не нулевой),
	//	а также известен основной менеджер партнера, то именно он будет контролировать оплату
	
	Результат = ЗаказНаряд.Проведен И ЗаказНаряд.Сумма <> 0 И 
				НЕ Менеджер.Пустая();
КонецПроцедуры
Процедура УдаленныйСкладВыдачиПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ПолучитьПоследнююЗадачу(БизнесПроцессы.РемонтИнструмента.ТочкиМаршрута.ПередатьКлиенту).Склад <> СкладПолучатель;
КонецПроцедуры
Процедура ПроверитьОплатуПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	// Стартуем ОжиданиеОплаты1 для случая, когда партнеру не назначен основной менеджер.
	// Поскольку до конца не известно какой именно склад будет контроливарот оплату, мы не можем использовать параллельную задачу ОжиданиеОплаты.
	
	Результат = ПроверитьОплату; 

КонецПроцедуры

Процедура Завершение2ПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	Если Не Заказы.УстановитьСостояниеЗаказа(Ссылка, Перечисления.СостоянияЗаказа.Отменен) Тогда Отказ = Истина КонецЕсли;
	
КонецПроцедуры
Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	Если Не Заказы.УстановитьСостояниеЗаказа(Ссылка, Перечисления.СостоянияЗаказа.Отгружен) Тогда Отказ = Истина КонецЕсли;
	
КонецПроцедуры

Процедура ОтказКлиентаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ОтказКлиента;
КонецПроцедуры

Процедура ОтказКлиента2ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ОтказКлиента;
КонецПроцедуры
